import datetime
import time
from pathlib import Path
import subprocess

# Приветствую читающих! Этот код написан "зеленым" програмистом, так что можете писать что можно оптимизировать

# Начнем с ввода нынешнего времени

currenttime = datetime.datetime.now()

# Это наши нынешние дата и время

#  Также я задам необходимые мне дату и время, ради тестов они будут меняться (т.к. неохота ждать несколько недель до запуска)

targetdate = datetime.datetime(2026, 11, 5, 00, 00, 00)

# Теперь у нас есть две нужные нам переменные, которые нужно сравнивать чтобы сработал запуск/удаление программы (на время тестов будет print())

# ТАкже на время тестов я сделаю еще пару переменных

# Здесь я буду менять именно переменную test2, для проверки срабатывания кода

test2 = datetime.datetime(2026, 10, 19, 21, 22, 00)

# Объекты datetime.datetime позволяют сравнить друг друга напрямую без костылей, поэтому делаю именно так

#if test >= test2 :
#    print("Все идет")
#else: print("Нифига")

# Так как я задал test .now, а test2 - определенным временем, получилось сразу. При изменении test2 на больший,
# чем нынешнее время, выдавало "Нифига", пока что значит все работает

# Добавлю объект while, и подожду чуть чуть, чтобы проверить работоспособность while

while True:
    
    # Переменную с методом .now надо вписывать в цикл, чтобы она тоже обновлялась вместе со всем циклом учитывая sleep()
    
    test = datetime.datetime.now()
    
    if test >= test2:
        print("Получилось")
        break
    else:
        print("Wait")
    time.sleep(5)

# Хорошо, цикл работает, осталось дописать команды модулей pathlib и subprocess

# Добавляем переменную, носящую путь к нашему .exe файлу

# r Перед строкой пути нужна для корректного использования системных слешей пути

exe = Path(r"C:\Windows\System32\notepad.exe")

# Проверка существования файла и его последующий запуск осущесвляется командой if exe.is_file

# Вот нужная нам концструкция :

#if exe.is_file():
#    print("File exist, launching...")
#    subprocess.Popen([str(exe)])
#else:
#    print("File does not exist")

# Помещаем ее в наш код проверки времени

while True:
    
    test = datetime.datetime.now()
    
    if test >= test2:
        if exe.is_file:
            print("File found, launching...")
            subprocess.Popen([str(exe)])
        else:
            print("File does not exist")
        break
    else:
        print("Wait")
    time.sleep(10)

# Да, работает. Если вы все таки будете использовать этот код, то меняйте нужное время в переменной test2,
# путь файла в переменной exe, время перерыва между циклами в конструкции time.sleep(n), где n - нужное кол-во секунд

# Первая версия готова. Новые версии будут у меня в профиле на Github 